examples/les_validation/waleAffine/0/epsilonS
FoamFile { version 2.0; format ascii; class volScalarField; location "0"; object epsilonS; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField
{
    xMin { type zeroGradient; } xMax { type zeroGradient; }
    yMin { type zeroGradient; } yMax { type zeroGradient; }
    zMin { type zeroGradient; } zMax { type zeroGradient; }
}
