examples/les_validation/waleAffine/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application GpuGkp;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 1e-12;
deltaT 1e-12;
writeControl runTime;
writeInterval 1e-12;
purgeWrite 0;
writeFormat ascii;
writePrecision 16;
writeCompression off;
timeFormat general;
timePrecision 16;
runTimeModifiable yes;
adjustTimeStep yes;
maxCo 0.4;
maxDeltaT 1e-12;
